{"data":{"site":{"siteMetadata":{"siteRepo":null,"postBasePath":null}},"markdownRemark":{"id":"bface104-6de0-5d1d-a9d8-04869ce48449","excerpt":"A popular article was  recently published  about the history of Alexandra Elbakyan’s Sci-Hub, a website that makes academic journal papers free to everyone. It…","html":"<p>A popular article was <a href=\"https://www.theverge.com/2018/2/8/16985666/alexandra-elbakyan-sci-hub-open-access-science-papers-lawsuit\">recently published</a> about the history of Alexandra Elbakyan’s Sci-Hub, a website that makes academic journal papers free to everyone. It’s a controversial topic following last year’s civil litigation by two major publishers, Elsevier and the American Chemical Society. Most recently, Cloudfare responded to the court’s injunction by <a href=\"https://twitter.com/Sci_Hub/status/959702088543539200\">terminating service</a> to Sci-Hub’s domains (<a href=\"https://torrentfreak.com/cloudflare-terminates-service-to-sci-hub-domain-names-180205/\">this</a> brings up additional ethical concern). Meanwhile, Sci-Hub dances away out of reach by staying available on other domain names inaccessible to the US without a VPN.</p>\n<p>Alexandra has become somewhat of a Martin Luther of science. Except her <em>Ninety-five Theses</em> is instead a database of 64 million academic papers in PDF. Her work makes science more accessible to the laity, instead of a submission to the interpretation and approval of academics from high-status institutions. My own Bachelor of Science makes me nervous about the implications of lay folk making decisions based on studies perused without understanding rigorous philosophies of science. However, this is an unavoidable aspect already being carried out by the shallow community of anti-science, FDA-approved pill pushers and social influencers with their online degrees and beauty blogs. But imagine a different scene of coffee shop discussions of fruit fly sleep cycles or dinner table deliberation over neuronal action potential.</p>\n<p>Paywalls and walled gardens for publications with insurmountable price tags make learning an exclusive, invite-only process for elite institutions. The effects of Reverend Luther’s translations of the bible to the German vernacular had tremendous impact on both religious <em>and</em> cultural contexts. With Sci-Hub making scientific studies more widely available, I wonder if these academic papers could receive the same widespread scrutiny that open source code receives from the developer community. Even rigorous disciplines receive contributions from amateur enthusiasts, like the hobbyist who recently <a href=\"https://skyriddles.wordpress.com/2018/01/21/nasas-long-dead-image-satellite-is-alive/\">found NASA’s lost satellite</a>.</p>\n<p>I am convinced that this is not primarily an economic issue but a moral one. While we’re bombarded with an endless stream of media in this digital era (like a <a href=\"http://nautil.us/issue/52/the-hive/modern-media-is-a-dos-attack-on-your-free-will\">DoS attack on our attention</a>), what effect would open discussions of empirical sources have on the quality of our media consumption, and even the advancement of our society? This is all a bit idealistic, but imagine this: a new generation of young scientists with the democratization of evidence-based persuasion. Taxpayers should have access to the research they paid for. Publishers hoard and monetize public research, but hopefully not for long.</p>","frontmatter":{"title":"Elbakyan is a heroine for modern science","date":"February 09, 2018","tags":["web","science"]}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2018-02-09-elbakyan-is-a-heroine/","previous":{"fields":{"slug":"/2017-10-17-fake-javascript/"},"frontmatter":{"title":"Fake Javascript: House of Horror","tags":["javascript","web"]}},"next":null}}