{"data":{"site":{"siteMetadata":{"title":"brettinternet","author":"@brettinternet"}},"markdownRemark":{"id":"2254fa9a-5cc1-5e7a-bd09-27b9b18bb353","excerpt":"I have my Plex Media Server running on a headless media server running Windows 10 Pro—unfortunately.\nUsing Windows comes at a very inconvenient cost with all…","html":"<p>I have my Plex Media Server running on a headless media server running Windows 10 Pro—unfortunately.\nUsing Windows comes at a very inconvenient cost with all the unexpected, forced updates.\nJust recently with the Creator’s Update version 1703, the update prevented my remote login because it had restarted with that same initial settings options that Windows prompts you with when you first set up the OS.\nThe primary benefit of running an app as a service is that services will start when the PC starts without having to login as a user first.</p>\n<p><img src=\"/images/windows1.png\" alt=\"windows update\"></p>\n<figcaption>Sneaky Windows updates at the worst times</figcaption>\n<p>There are a few options for setting up Plex as a service: <a href=\"https://nssm.cc/\">NSSM</a>, <a href=\"https://forums.plex.tv/discussion/93994/pms-as-a-service\">PMS as a service</a>—written specifically for Plex—and <a href=\"http://www.rozanski.org.uk/services#srvstart\">SRVSTART</a>. NSSM seems to be the de facto solution for lots of folks, and in my experience is has been a very trustworthy tool on PC. I use NSSM for a few other apps on my media server like PlexPy, Sonarr and Plex Requests.</p>\n<h3>NSSM</h3>\n<p><a href=\"https://nssm.cc/download\">NSSM</a> is the non-sucking service manager. I use <a href=\"https://chocolatey.org/\">Chocolately</a> to install NSSM.</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">choco install -y nssm</code></pre></div>\n<p>Open an elevated command prompt as administrator. If you’d like to use the NSSM GUI, simply use:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">nssm install</code></pre></div>\n<p>This will open up the NSSM GUI. Otherwise, like myself, you may just prefer a few commands on the CLI.</p>\n<p>The steps are simple, and they’ve been outlined <a href=\"https://www.jecal22.com/how-to-run-plex-media-server-as-a-windows-service-2/comment-page-1/\">here</a>.</p>\n<p>Here are some of my notes on additional <a href=\"https://github.com/brettinternet/public-notes/blob/master/devops/nssm.md\">NSSM commands</a>.</p>\n<h3>PMS as a Service</h3>\n<p>PMS as a Service is created by a Plex community member. It’s an incredibly simple <a href=\"https://github.com/cjmurph/PmsService/releases\">install</a>. You’ll have to enter your user credentials since the app needs an elevated status to manage a service.</p>\n<h3>Automatic Updates</h3>\n<p>If you’re a Plex subscriber, there are frequent Plex updates. And if you’ve elected to use PMS as a service, then you can also use this handy little piece of software, <a href=\"https://github.com/TechieGuy12/PlexServerAutoUpdater\">PlexServerAutoUpdater</a>, which will stop your PMS service, update Plex automatically on your command and restart the service afterwards. You do have to configure Plex to <code class=\"language-text\">Automatically download updates</code>, this can be done in the server settings. According to the developer, PlexServiceAutoUpdater:</p>\n<blockquote>\n<ol>\n<li>Stops the Plex service.</li>\n<li>Stops any Plex processes that are running.</li>\n<li>Installs the latest update.</li>\n<li>Deletes the Run keys from the registry to prevent Plex from running outside of the service.</li>\n<li>Stops any Plex processes that are running after the update.</li>\n<li>Restarts the Plex service.</li>\n</ol>\n</blockquote>\n<p>These steps are critical with Plex running as a service, because you don’t want multiple instances of Plex running. You can read more about this software and how to use Task Scheduler to schedule your updates <a href=\"http://technicallyeasy.net/update-plex-automatically-running-plex-service/\">on the author’s blog</a>.</p>\n<p>While I frequently remote into my servers to see what’s going on, and I have <a href=\"https://github.com/influxdata/telegraf\">Telegraf</a> collecting status info on my servers, I’ll still occasionally find my media server down without my knowing - typically because of some Windows update that required an abrupt restart.\nClearly Windows 10 is not a server OS.\nIf you have the cash💰, Windows Server comes with some measures to prevent this. Eventually, I’ll set up all my media server apps on a linux box or run them in docker containers. Until then, running Plex Media Server as a service is exactly what I need.</p>","frontmatter":{"title":"Run Plex Media Server as a Service","date":"May 15, 2017"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2017-05-15-run-plex-media-server-as-a-service/"}}