{"data":{"site":{"siteMetadata":{"title":"brettinternet","author":"@brettinternet"}},"markdownRemark":{"id":"424a5118-31e7-5c9a-8121-5890c47d33ef","excerpt":"There is a common graph shared amongst front-end developers. It uses Google Trends to compare worldwide Google searches between React (blue) and Angular (red…","html":"<p>There is a common graph shared amongst front-end developers. It uses Google Trends to compare worldwide Google searches between React (blue) and Angular (red) for the past 4 years. I don't intend on comparing Angular and React. Although the comparison is a hot topic (<a href=\"https://www.quora.com/Is-React-killing-Angular\">here</a> and <a href=\"https://medium.freecodecamp.com/angular-2-versus-react-there-will-be-blood-66595faafd51#.u1dv8qod4\">here</a>), they're not quite comparable since they're both in different stages of their lifecycle, along with Angular 2 just now leaving beta.</p>\n<p><img src=\"/images/angularreact.png\" alt=\"angular vs react\"></p>\n<h6><a href=\"https://trends.google.com/trends/explore?q=react,angular\">From Google Trends</a></h6>\n<p>The one conclusion I will draw is that after Christmas, it's a long, sleepy weekend for a large amount of developers before the new year.\nThe internet may never sleep, but perhaps there are brief moments when creation slows and the keyboards rest.\nThere is a similar trend with <a href=\"https://npm-stat.com/charts.html?package=react&#x26;package=vue&#x26;package=angular&#x26;from=2016-01-01&#x26;to=2017-08-19\">NPM downloads</a>.\nI don't mean to assume React and Angular make up all the internet, or even a majority.\nHowever, I'd like to think of a hardworking developer somewhere in this cold winter that quietly powers down his or her workstation for some time with the family.</p>\n<p>I hope we deserve the holiday rest. This has been a wild year. For myself, learning to code this year and falling in love with it has left me anxious and excited for upcoming projects. And in a much broader sense, with the election and recent celebrity deaths, we're ready to begin anew.</p>\n<p>In a sense, the holiday break is a goodnight's rest for a career. Perhaps the most noteworthy conclusion to draw from this simple chart is that javascript libraries are becoming more popular. With the new year will come a fresh new day in our careers as developers and more opportunities for new coders to learn additional libraries and novel tools.</p>","frontmatter":{"title":"When Front-end Developers Play: Happy New Year","date":"December 15, 2016","description":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2016-12-15-happy-new-year/","previous":{"fields":{"slug":"/2016-11-03-becoming-a-professional-googler/"},"frontmatter":{"title":"Becoming a Professional Googler"}},"next":{"fields":{"slug":"/2016-02-06-managing-notes-with-markdown-and-git/"},"frontmatter":{"title":"Manage Notes with Markdown and Git"}}}}