{"data":{"site":{"siteMetadata":{"siteRepo":"https://github.com/brettinternet/brettinternet.github.io"}},"markdownRemark":{"id":"2d3cc72e-80a1-5950-96bf-4bf3c833d275","excerpt":"Firewall software might seem like a peculiar resource for a web developer to use, but I’ve found it to be an essential item on my developer tool belt…","html":"<p>Firewall software might seem like a peculiar resource for a web developer to use, but I’ve found it to be an essential item on my developer tool belt. Protecting your network interface is a critical section in this popular write-up <a href=\"https://github.com/forter/security-101-for-saas-startups/blob/english/security.md#antivirusfirewall\">Security 101</a>. OpenVPN, reverse proxy, traffic watch, and other addons make pfSense part of my personal DevOps.</p>\n<p>I used to work closely with a company’s sysadmin in a previous job.\nTogether with his help and some extensive research, I was able to harness a few of the wonderful open source tools that <a href=\"https://www.pfsense.org/\">pfSense</a> bundles together.\nThe <a href=\"https://forum.pfsense.org/\">community</a> is full of intelligent professionals. As with all technical forums, entry-level participation can be intimidating. Networking is also a difficult subject to learn and harder to practice, but I use my own home network as a playground to implement some concepts. While pfSense is indeed enterprise-level software, this walkthrough is for hobbyists.</p>\n<p><img src=\"/images/pfsense1.png\" alt=\"censors\"></p>\n<h6>I can monitor my hardware from my pfSense dashboard</h6>\n<h2>Hardware</h2>\n<p>I’m using a retired, old computer from a previous job, but a bottle of canned air knocked off a couple of years from the old bulky metal frame.\nThis junker has two cores and 4GB of DDR3 RAM, but I’ve never had any issues with it on my gigabit network.\nIt’s big for what it does, so an Intel NUC might be better if space is a concern. The hardware requirements are minimal, but pfSense does offer <a href=\"https://www.pfsense.org/hardware/#requirements\">some recommendations</a> and <strong>dual NICs are required</strong>—you <em>must</em> have two ethernet ports for LAN and WAN.</p>\n<p>I’ve chosen to add an additional spindle disk for parity, but backing up your firewall config is very easy so this isn’t necessary.\nTogether with this inexpensive <a href=\"https://www.amazon.com/gp/product/B003CFATNI/ref=oh_aui_search_detailpage?ie=UTF8&#x26;psc=1\">TP-Link NIC</a> and a <a href=\"https://www.amazon.com/NETGEAR-GS105NA-Ethernet-Replacement-Unmanaged/dp/B0000BVYT3/\">network switch</a>, my old machine has been sufficient hardware for what I need.\nEventually, when I can afford to graduate my servers to a server rack, I’ll upgrade my firewall to a small, 1U case.</p>\n<h2>Software</h2>\n<p>The pfSense software is free and open source. You can <a href=\"https://pfsense.org/download/\">download it here</a> for your specific build and the easiest install is with a USB. Use <a href=\"https://rufus.akeo.ie/\">rufus</a>, <a href=\"https://github.com/resin-io/etcher/\">etcher</a> or <a href=\"http://unetbootin.github.io/\">unetbootin</a> to write the image to your USB.</p>\n<h3>Setup</h3>\n<p>The ultimate <a href=\"https://doc.pfsense.org/index.php/Installing_pfSense\">pfSense installation guide</a> is by the creators themselves on their wiki. But I’ll walk through my process here.</p>\n<p>Plug in your USB and boot up your machine. To enter the boot options menu, you usually press DEL, F8 or F12 as the BIOS splash screen appears depending on your hardware. You should then see the following screen:</p>\n<p><img src=\"/images/pfsense2.jpg\" alt=\"setup\"></p>\n<h6>pfSense installation menu</h6>\n<p>Select <code class=\"language-text\">1</code> to begin the installation.\nThen, press <code class=\"language-text\">i</code> to launch the installer. In the following screens let’s go with the default configurations: <code class=\"language-text\">Accept these Settings</code>, then choose <code class=\"language-text\">Quick/Easy Install</code>.\nIf you’re an advanced user, you’d use ‘Custom Install’ to choose which disk to install to and partitioning setup.\nContinue through the setup and confirm the request to format and write your disk.</p>\n<p>Once the partitions are created and the kernel is installed, you’ll be prompted to reboot.\nYou can now eject your USB installer. When your pfSense machine reboots, you’ll now be prompted to setup your network interfaces.\nThe first option is for <code class=\"language-text\">VLAN</code> setup, but generally VLANs are for advanced networking and we don’t need it here.</p>\n<p>Next, you’ll set your <code class=\"language-text\">WAN</code> and <code class=\"language-text\">LAN</code> interfaces.\nDepending on your hardware, these interfaces can have different names—your interfaces may look like <code class=\"language-text\">em0</code>, <code class=\"language-text\">em1</code> or <code class=\"language-text\">bge0</code>, <code class=\"language-text\">ce0</code>.\nYou’ll need to assign the correct interface to the WAN and the other to the LAN interface.\nSelect the appropriate options and follow the prompts.</p>\n<p><img src=\"/images/pfsense3.jpg\" alt=\"options\"></p>\n<p>After setting up your network interfaces, you’ll now see an options menu on the CLI with numbers 1 through 14 or 15.\nIf you set up the interfaces correctly, you’ll see WAN and LAN IP addresses.\nYou should also see an <code class=\"language-text\">http://</code> IP address which you can access on the LAN network to view the pfSense GUI.\nThe default username and password should be <code class=\"language-text\">admin</code> and <code class=\"language-text\">pfsense</code>. If not, <a href=\"https://doc.pfsense.org/index.php/Installing_pfSense\">refer to the docs</a> for the latest credentials.\nYou should walk through the setup wizard to complete the installation.</p>\n<p>I’ll go over usage and some extra packages that I use with pfSense in the <a href=\"%7B%25%20post_url%202017-07-22-use-pfsense-as-a-developer%20%25%7D\">next post</a>.</p>","frontmatter":{"title":"Configure pfSense as a Developer - Part 1","date":"July 14, 2017"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2017-07-14-configure-pfsense-as-a-developer/","previous":null,"next":{"fields":{"slug":"/2017-07-22-use-pfsense-as-a-developer/"},"frontmatter":{"title":"Use pfSense as a Developer - Part 2"}}}}