{"data":{"site":{"siteMetadata":{"title":"brettinternet","author":"@brettinternet"}},"markdownRemark":{"id":"b48b28ec-0519-51f0-942e-4f5fc4486678","excerpt":"I’d love to tell you that since studying neuroscience in school, things come easy to me since I’m ✨so smart✨. However, this is simply not the case.\nTo keep up…","html":"<p>I’d love to tell you that since studying neuroscience in school, things come easy to me since I’m ✨so smart✨. However, this is simply not the case.\nTo keep up with my peers, I took meticulous notes, read and reread assignments, and I constantly evaluated my priorities to stay on task.\nI became obsessed with productivity. I was always looking out for the next shiny tool to help me get an edge in competitive learning.\nI’ve used apps like OmniFocus or Wunderlist to simpler tools like Apple Reminders.</p>\n<p>For a while I used Evernote for note-taking, then I tried OneNote, Apple Notes and even Google Keep.\nI left Evernote because they’d seemed to have lost their way with gimmicky features.\nI liked that OneNote didn’t force-feed a premium option and it was just as accessible as Evernote.\nLater, I thought that maybe Apple Notes would be just enough for me, but I eventually found that it wasn’t better for anything other than lists or using the touch draw feature.</p>\n<p>Now as a developer, I use markdown in my IDE.\nThis process for note-taking certainly isn’t novel–you’ll even find books on Github written with markdown.\nMarkdown offers the most formatting versatility, especially to display code excerpts with syntax highlighting and quickly reference links, create lists, and break notes out by sections.\nThis is especially true since Github’s flavoring and small enhancements have made markdown previewing so accessible. Even this blog is made using markdown.</p>\n<h3>Markdown</h3>\n<p>I love markdown.\nI like how widely support it is, and I like how clear markdown format is to convey information.\nMarkdown has become the ubiquitous plain text format for the GitHub community.\nMy own blog posts are written in markdown and compiled with <a href=\"https://github.com/brettinternet/minimaless/\">Jekyll</a>.</p>\n<h3>Git</h3>\n<p>Right now I have a <a href=\"https://bitbucket.org/brettinternet\">BitBucket</a> for my private repos and notes and I use GitHub for my <a href=\"https://github.com/brettinternet/public-notes\">public notes</a>.\nEventually, I’ll set up my own Gitlab to self-host my own repos.</p>\n<p>My commit messages are short, but they’re also meaningful so I can see my note history and refer back to find deleted excerpts. I also use <a href=\"https://github.com/brettinternet/dotfiles/blob/master/.aliases\">aliases</a> for git commands to make pushing to master very fast.</p>\n<h3>Desktop</h3>\n<p>I use Vim.\nTo me, taking notes in my editor environment is the best possible scenario since I’m most comfortable with the shortcuts.\nAtom is also a great option.\nIt has a markdown previewer you can access with <code class=\"language-text\">ctrl</code> + <code class=\"language-text\">shift</code> + <code class=\"language-text\">m</code>.\nThe big advantage with markdown is that just about anything can open it up and preview it.\nI’m no longer bound to an app’s platform to view my notes.</p>\n<p>I do very little clipping from the web.\nI tend to think that a simple bookmark is better.\nEverNote certainly has the strongest clipper, and I do like that OneNote’s web clipper is <a href=\"https://blogs.msdn.microsoft.com/onenotedev/2016/08/31/the-web-clipper-goes-open-source/\">open source</a>.\nThere are a few other open source alternatives that have been mentioned in the self-hosting subreddit, but I haven’t looked into them yet.</p>\n<h3>Mobile</h3>\n<p>Before I found <a href=\"https://workingcopyapp.com/\">Working Copy</a>, a solid mobile git solution for iOS was <em>the</em> missing piece for keeping notes in a git repo.\nI’m sure there are equally polished options on Android.\nWith Working Copy you can fetch repos for free, but you’ll have to pay to unlock push.\nI think it’s worth it to support this developer.\nThe app supports SSH keys, language highlighting and markdown and plain text previews.\nIt’s an excellent mobile option and nearly an IDE for iOS.</p>\n<h3>Save Menu</h3>\n<p>It’s true, this method isn’t perfect.\nI need separate tools for sketches and pdf markups.\nBut these mediums make up about 0.5% of all my notes.\nI just use my ownCloud for storing files or Keybase for my public documents.</p>\n<p>However, markdown is certainly here to stay.\n<a href=\"https://githubengineering.com/a-formal-spec-for-github-markdown/\">Some recent specification</a> has been proposed to standardize Github’s flavor of markdown.\nOne of my favorite introductions to markdown can be found <a href=\"http://commonmark.org/\">here</a>.\nCommonmark was put together by a few representatives of some major techs like GitHub, Reddit, and Stack Exchange.</p>\n<blockquote>\n<p>Everything not saved will be lost.</p>\n<p>- <em>Nintento “Quit Screen” message</em></p>\n</blockquote>\n<p>Like an accessible save menu, I keep everything in markdown.\nI record docker commands and obscure command-line arguments, JavaScript toy problems, or directions to setup Postgres permissions.\nI’ll only make a note on it if it’s easier to reference my notes than it is to <a href=\"%7B%25%20post_url%202016-11-03-becoming-a-professional-googler%20%25%7D\">Google search it</a>.\nI also take notes to help out the students that I mentor. You can checkout my <a href=\"https://github.com/brettinternet/public-notes\">public notes</a> on GitHub.</p>\n<p>Apple Reminders still works for me with short term personal todos, and Trello for team projects.\nBut for notes, I like good ol’ fashioned git and markdown.\nI use a private BitBucket repo for my personal notes, and GitHub for my public notes.\nEventually I’ll self-host a git service like Gitlab.\nPerhaps you’ll think I’m a monk or a Luddite for not choosing the prettiest new apps, but I believe this method is the strongest embrace of trustworthy technology.\nGit and markdown are two timeless tools that are sure to be around for a long time.</p>","frontmatter":{"title":"Manage Notes with Markdown and Git","date":"February 06, 2017"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2017-02-06-managing-notes-with-markdown-and-git/","previous":null,"next":{"fields":{"slug":"/2017-03-02-play-and-visual-spotify-music-in-terminal/"},"frontmatter":{"title":"Play and Visualize Spotify Music in Terminal with Mopidy and Ncmpcpp"}}}}