{"data":{"site":{"siteMetadata":{"title":null,"author":null}},"markdownRemark":{"id":"db9d41b3-6ff7-59e4-a9a5-517a287957cb","excerpt":"Music One of my favorite authors, Kurt Vonnegut, said: If I should ever die, God forbid, let this be my epitaph: The only proof he needed for the existence of…","html":"<h2>Music</h2>\n<p>One of my favorite authors, Kurt Vonnegut, said:</p>\n<blockquote>\n<p>If I should ever die, God forbid, let this be my epitaph: The only proof he needed for the existence of God was music.</p>\n</blockquote>\n<p>Kurt was a humanist and an atheist, but he still recognized a transcendent power in music. You might feel the same way whether you’re religious or not.</p>\n<p>Sometimes listening isn’t enough, and you just have to make your own sound. That’s how I felt over a year ago. It was gnawing away at me, and I simply <em>had</em> to create something. In the digital age, it’s not difficult to set up your own space to create the sounds you want.</p>\n<h2>Hardware</h2>\n<h3>MIDI Controllers</h3>\n<p>A MIDI controller isn’t required, but something with a keyboard makes it easier to physically realize the digital creation process.\nDon’t be overwhelmed by gear, choosing a cheap controller is common advice for entry-level hobbyists.\nIf you stick with it, you can upgrade later.</p>\n<h4>Picking a controller</h4>\n<p>For my very first controller, I went with the <a href=\"https://www.amazon.com/gp/product/B00IJ6QAO2/\">Akai MPK Mini MKII</a>. It’s a low budget option that’s both compact and has a keyboard.</p>\n<p>I had some initial apprehensions about a budget controller.\nSome folks claimed there was a latency delay, others complain about the software.\nI don’t use the stock software, and there are easy ways to correct latency issues.\nI haven’t had any trouble with my choice so far.</p>\n<p>There are even some software options available for mobile devices that you might consider like Novation’s <a href=\"https://itunes.apple.com/us/app/launchpad-make-remix-music/id584362474\">Launchpad</a>. Some software controllers can link to Ableton.</p>\n<h4>Akai MPK Mini MKII Setup</h4>\n<p>After you register your controller on the akaipro.com website, you can <a href=\"http://www.akaipro.com/account/productreg/products\">download the software</a>. There aren’t drivers that you’ll need, but it’s a good idea to upgrade the firmware.</p>\n<p><img src=\"/images/akai-controller-firmware-1.png\" alt=\"upgrading the controller firmware\"></p>\n<h6>Follow the steps to upgrade the firmware</h6>\n<p>You might be tickling those ivories already, but you won’t hear anything until we set up the software.</p>\n<h3>Headphones</h3>\n<p>If you’re looking for headphones, <a href=\"https://www.reddit.com/r/headphones/\">/r/headphones</a> has a very helpful guide <a href=\"https://sites.google.com/view/quipa/assistants\">here</a> to pick the right equipment. The community there has tailored the selection process according to various consumer needs.</p>\n<h2>Software</h2>\n<h3>Ableton</h3>\n<p>I’ve gone with Ableton Live since a few of my friends use it, and they have a great entry-level price. You can <a href=\"https://www.ableton.com/en/trial/\">try it</a> for a month to see if it’s right for you. There are plenty of other music production software options.</p>\n<h4>Controller Setup with Ableton</h4>\n<p>For the most part, using a controller with Ableton is plug-and-play.\nWatch <a href=\"https://www.ableton.com/en/live/learn-live/\"><em>Setting Up a MIDI Controller</em></a> which will briefly explain the key points to working with a controller in Ableton.</p>\n<p><img src=\"/images/ableton-setup-1.png\" alt=\"midi setup in ableton settings\"></p>\n<h6>Setup the controller input from Ableton preferences</h6>\n<h4>Learn Ableton</h4>\n<p>There are lots of resources for learning Ableton or other music production software.\nI recommend Pluralsight and <a href=\"https://www.coursera.org/learn/ableton-live\">Coursera</a> for their introduction courses.\nCoursera is a high-quality free option. Otherwise, YouTube has plenty of tutorials.</p>\n<h3>Plugins</h3>\n<p>There are endless plugins and instruments you can add to the production software. Massive and Battery are popular options, but I recommend sticking with the stock plugins and instruments. Once you’re comfortable with what’s available, then slowly start to expand.</p>\n<h2>Create</h2>\n<p>For me, creation is cathartic.\nTaking on a hobby like this is a marathon, not a sprint.\nMastering a craft takes a long time.\nTake the time to learn the tools and explore music theory to understand your own creation process.\nEventually, all the hard work is justified by creativity, and in the end it’s worth it.</p>","frontmatter":{"title":"Set Up a MIDI Controller with Ableton Live","date":"August 12, 2017"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2017-08-12-set-up-midi-controller-with-ableton/","previous":null,"next":{"fields":{"slug":"/2017-10-17-fake-javascript/"},"frontmatter":{"title":"Fake Javascript: House of Horror"}}}}