{"data":{"site":{"siteMetadata":{"title":"brettinternet","author":"@brettinternet"}},"markdownRemark":{"id":"97d37b1d-c444-5ee3-8386-0dd7ae15c6df","excerpt":"I went over  setting up pfSense  earlier.\nI also discussed some reasons why a feature-packed firewall is relevant to developer operations. Now that you’ve…","html":"<p>I went over <a href=\"%7B%25%20post_url%202017-07-14-configure-pfsense-as-a-developer%20%25%7D\">setting up pfSense</a> earlier.\nI also discussed some reasons why a feature-packed firewall is relevant to developer operations.</p>\n<p>Now that you’ve finished the initial pfSense firewall setup, let’s checkout some useful packages and tools you can explore. From the menu you can access <code class=\"language-text\">System</code> > <code class=\"language-text\">Package Manager</code>.</p>\n<p>Some packages I use:</p>\n<ul>\n<li><strong>acme</strong>: Let’s Encrypt automated certificate renewal</li>\n<li><strong>haproxy</strong>: reverse proxy and load balancer</li>\n<li><strong>iftop</strong>: interface monitor</li>\n<li><strong>open-vpn-client-export</strong>: makes preparing your openVPN config for devices very easy</li>\n<li><strong>pfBlockerNG</strong>: reputation management and block lists like the <a href=\"https://github.com/easylist/easylist\">easylist</a></li>\n<li><strong>Status<em>Traffic</em>Totals</strong>: a fancy graph and statistics measuring your traffic (pictured below)</li>\n</ul>\n<p><img src=\"/images/pfsense4.png\" alt=\"censors\"></p>\n<h6>I use the internet a lot.</h6>\n<p>Since pfSense runs on FreeBSD, anything that works with FreeBSD can be installed via the command line. There are other great packages that handle common networking tasks like <code class=\"language-text\">nmap</code> and <code class=\"language-text\">darkstat</code>.</p>\n<h3>Reverse Proxy</h3>\n<p>There are couple packaged options available to run a reverse proxy to your servers. I run a few different websites out of my home network for private use.\nFor example, I run a <a href=\"https://github.com/tidusjar/Ombi\">Plex Request portal</a> and a couple of portfolio projects.\nGoogle will only give me one public IP, so I use a reverse proxy on my firewall to route web traffic to the right server and port.\nYou can also install nginx on FreeBSD via the CLI.</p>\n<p>I first tried Squid Reverse Proxy but the setup wasn’t as straightforward as Haproxy. Both are excellent options but Haproxy’s load balancer is very mature.</p>\n<h3>VPN</h3>\n<p>The setup wizard for OpenVPN will walk you through creating a self-signed certificate. If there’s a router further up your firewall’s WAN, then you may need to forward port 1194.</p>\n<p>OpenVPN defaults to use the SHA1 hashing algorithm. Side note: did you hear about the <a href=\"https://security.googleblog.com/2017/02/announcing-first-sha1-collision.html\">first anticipated collision</a> with SHA1? This isn’t a big deal yet, but you may consider changing this to SHA3 or SHA5.</p>\n<h3>Firewall</h3>\n<p>Besides the easylists available on pfBlockerNG, you can find <a href=\"https://www.iblocklist.com/lists\">other lists</a> to block depending on the needs of your network.</p>\n<hr>\n<p>After a couple years of using pfSense, I’ve only scratched the surface.\nMany of these tools aren’t exclusive to pfSense, but the firewall sure does make it easy to setup with an attractive GUI.</p>\n<p>Once you’re comfortable here, your next task is to set up <a href=\"https://forum.pfsense.org/index.php?topic=95210.0\">2FA with pfSense</a>, <a href=\"https://doc.pfsense.org/index.php/Mobile_One-time_Passwords_with_FreeRADIUS\">mOTP</a> or use the traffic shaper to optimize your VoIP’s bandwidth.</p>","frontmatter":{"title":"Use pfSense as a Developer - Part 2","date":"July 22, 2017"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2017-07-22-use-pfsense-as-a-developer/"}}