{"data":{"site":{"siteMetadata":{"title":"brettinternet","author":"@brettinternet"}},"markdownRemark":{"id":"4d90d9e1-003b-5b4c-a4b8-10c19e57039d","excerpt":"Apple’s overpriced offering is moving away from modular, upgradable hardware. Some recent unveils of the iMac, Mac Pro, and MacBook Pro failed to meet the…","html":"<p><img src=\"/images/system-info.png\" alt=\"system-info\"></p>\n<p>Apple’s overpriced offering is moving away from modular, upgradable hardware. Some recent unveils of the iMac, Mac Pro, and MacBook Pro failed to meet the expectations of many professionals that demand improved computer specs. Using the more powerful hardware available with macOS can be the ultimate environment for a developer—Unix coupled with strong machinery. For example, at the time of writing this, I’m on my Kaby Lake build, but current Apple hardware doesn’t offer the newest Intel generation. This is currently experimental in the community, but more stable options do exist with Skylake hardware.</p>\n<p>Of course, I’ve always owned a MacBook. There are aspects of Apple’s laptops that other hardware manufactures have not been able to match for me quite yet. But as for a desktop where form factor, sleek aluminum design, and the incredibly responsive trackpad are not concerns, then a Hackintosh is the way to go for tabletop computing.</p>\n<p>Should you build a hackintosh? Probably not. It’s a breach of Apple’s macOS Terms and Conditions, but Apple has been kind and <a href=\"https://www.reddit.com/r/hackintosh/comments/2ek35g/is_it_technically_illegal/\">hasn’t litigated individuals</a>, but they <a href=\"https://en.wikipedia.org/wiki/Psystar_Corporation\">have sued companies</a> that attempt to turn a profit. Building a Hackintosh involves a <em>lot</em> of troubleshooting and tinkering. But if you’re okay with all of this, then try it out! The first place to start is to begin lurking in these communities: <a href=\"https://reddit.com/r/hackintosh\">/r/hackintosh</a>, <a href=\"https://www.tonymacx86.com\">tonymacx86</a> and <a href=\"http://www.insanelymac.com/\">insanelymac</a>.</p>\n<p>I’ve posted a <a href=\"https://github.com/brettinternet/hackintosh/blob/8788216554bf169d0f7eff2581ab372e14ce3b2b/docs/setup.md\">guide to my most recent build</a> where I use the latest Kaby Lake Intel processor and the latest mobo. I use an NVMe SSD, bluetooth accessories, iMessage, and other necessary features. My passion for Hackintosh fluctuates with my availability, but you can see my builds, guides and troubleshooting research at <a href=\"https://github.com/brettinternet/hackintosh\">brettinternet/hackintosh</a>.</p>","frontmatter":{"title":"Building a Hackintosh","date":"April 23, 2017"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2017-04-23-build-a-hackintosh/","previous":{"fields":{"slug":"/2017-03-02-play-and-visual-spotify-music-in-terminal/"},"frontmatter":{"title":"Play and Visualize Spotify Music in Terminal with Mopidy and Ncmpcpp"}},"next":{"fields":{"slug":"/2017-05-15-run-plex-media-server-as-a-service/"},"frontmatter":{"title":"Run Plex Media Server as a Service"}}}}